## staging: ses_to_sqs_email_callbacks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                              |
|--------|----------------------------------------------------------------|
| add    | `aws_lambda_permission.allow_sns_ses_callbacks`                |
|        | `aws_sns_topic_subscription.ses_sns_to_lambda`                 |
| delete | `aws_lambda_event_source_mapping.sqs_batch_callbacks_trigger`  |
| update | `module.ses_to_sqs_email_callbacks.aws_iam_policy.policies[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_lambda_event_source_mapping.sqs_batch_callbacks_trigger will be destroyed
  # (because aws_lambda_event_source_mapping.sqs_batch_callbacks_trigger is not in configuration)
  - resource "aws_lambda_event_source_mapping" "sqs_batch_callbacks_trigger" {
      - arn                                = "arn:aws:lambda:ca-central-1:239043911459:event-source-mapping:a45fcfcb-710c-4dea-80bb-41f8ff0090ef" -> null
      - batch_size                         = 10 -> null
      - bisect_batch_on_function_error     = false -> null
      - enabled                            = true -> null
      - event_source_arn                   = "arn:aws:sqs:ca-central-1:239043911459:ses-receipt-callback-buffer" -> null
      - function_arn                       = "arn:aws:lambda:ca-central-1:239043911459:function:ses_to_sqs_email_callbacks" -> null
      - function_name                      = "arn:aws:lambda:ca-central-1:239043911459:function:ses_to_sqs_email_callbacks" -> null
      - id                                 = "a45fcfcb-710c-4dea-80bb-41f8ff0090ef" -> null
      - last_modified                      = "2025-06-02T17:28:18Z" -> null
      - maximum_batching_window_in_seconds = 1 -> null
      - maximum_record_age_in_seconds      = 0 -> null
      - maximum_retry_attempts             = 0 -> null
      - parallelization_factor             = 0 -> null
      - state                              = "Enabled" -> null
      - state_transition_reason            = "USER_INITIATED" -> null
      - tags_all                           = {} -> null
      - tumbling_window_in_seconds         = 0 -> null
      - uuid                               = "a45fcfcb-710c-4dea-80bb-41f8ff0090ef" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.allow_sns_ses_callbacks will be created
  + resource "aws_lambda_permission" "allow_sns_ses_callbacks" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "ses_to_sqs_email_callbacks"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = "arn:aws:sns:ca-central-1:239043911459:ses-callback"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # aws_sns_topic_subscription.ses_sns_to_lambda will be created
  + resource "aws_sns_topic_subscription" "ses_sns_to_lambda" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:lambda:ca-central-1:239043911459:function:ses_to_sqs_email_callbacks"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ca-central-1:239043911459:ses-callback"
    }

  # module.ses_to_sqs_email_callbacks.aws_iam_policy.policies[0] will be updated in-place
  ~ resource "aws_iam_policy" "policies" {
        id               = "arn:aws:iam::239043911459:policy/ses_to_sqs_email_callbacks-0"
        name             = "ses_to_sqs_email_callbacks-0"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "sqs:SendMessage",
                            "sqs:Get*",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:sqs:ca-central-1:239043911459:eks-notification-canada-cadelivery-receipts"
                    },
                  - {
                      - Action   = [
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:ca-central-1:239043911459:ses-receipt-callback-buffer"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "CostCentre" = "notification-canada-ca-staging"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ses_to_sqs_email_callbacks_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-ses-delivery-receipts-errors-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-ses-delivery-receipts-errors-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-ses_to_sqs_email_callbacks-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-ses_to_sqs_email_callbacks-500-errors-api[0]"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
